tap "apple/apple", "https://gitee.com/ineo6/homebrew-apple.git"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/services", "https://gitee.com/imirror/homebrew-services.git"
cask "cord"
cask "flutter"
vscode "1YiB.rust-bundle"
vscode "766b.go-outliner"
vscode "aaron-bond.better-comments"
vscode "aaronthomas.vscode-snazzy-operator"
vscode "abusaidm.html-snippets"
vscode "adpyke.codesnap"
vscode "alexisvt.flutter-snippets"
vscode "Alibaba-Cloud.tongyi-lingma"
vscode "alibabacloud-cloudtoolkit.toolkit-vscode"
vscode "antfu.iconify"
vscode "antfu.unocss"
vscode "bbenoist.shell"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "cipchk.cssrem"
vscode "cschlosser.doxdocgen"
vscode "Dart-Code.dart-code"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-faker"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "dunstontc.vscode-go-syntax"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "eg2.tslint"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "felipecaputo.git-project-manager"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "gencer.html-slim-scss-css-class-completion"
vscode "gio00.fish"
vscode "giscafer.leek-fund"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "go-home.go-home"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "helixquar.asciidecorator"
vscode "hirantha.json-to-dart"
vscode "hollowtree.vue-snippets"
vscode "humao.rest-client"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jock.svg"
vscode "johnpapa.pwa-tools"
vscode "JScearcy.rust-doc-viewer"
vscode "Kasik96.swift"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "llldar.vsc-memer"
vscode "luanpotter.dart-import"
vscode "mhutchie.git-graph"
vscode "miclo.sort-typescript-imports"
vscode "mikestead.dotenv"
vscode "mkxml.vscode-filesize"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "msyrus.go-doc"
vscode "naumovs.color-highlight"
vscode "OBKoro1.korofileheader"
vscode "oderwat.indent-rainbow"
vscode "oscarcs.dart-syntax-highlighting-only"
vscode "pflannery.vscode-versionlens"
vscode "pieterjongsma.swift-playgrounds"
vscode "PKief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "Prisma.prisma"
vscode "prograhammer.tslint-vue"
vscode "qiu8310.minapp-vscode"
vscode "rbbit.typescript-hero"
vscode "redhat.vscode-yaml"
vscode "richardmarks.vscode-perfect-dark-color-theme"
vscode "ritwickdey.LiveServer"
vscode "russell.any-rule"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "ryu1kn.partial-diff"
vscode "sburg.vscode-javascript-booster"
vscode "serayuzgur.crates"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "SimonSiefke.svg-preview"
vscode "sleistner.vscode-fileutils"
vscode "smockle.xcode-default-theme"
vscode "spook.easysass"
vscode "sswg.swift-lang"
vscode "stylelint.vscode-stylelint"
vscode "syler.sass-indented"
vscode "sysoev.language-stylus"
vscode "thisismanta.stylus-supremacy"
vscode "tinkertrain.theme-panda"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vknabel.vscode-apple-swift-format"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "WakaTime.vscode-wakatime"
vscode "WallabyJs.console-ninja"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
vscode "wmaurer.change-case"
vscode "Wscats.uni-app"
vscode "Yao-Translate.yao-translate"
vscode "yzhang.dictionary-completion"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "Zignd.html-css-class-completion"
vscode "ZixuanChen.vitest-explorer"
vscode "zuoez02.tslint-snippets"
